sdaiCreateNestedAggrByIndex(Sdai_Id_aggr*,System.UInt32)
\details
Creates a nested aggregate instance within a specified aggregate instance at the position specified by the index.
\param aggregate [in] An aggregate instance that contains the created nested aggregate.
\param index     [in] An index that determines the position of the created item.
\returns The identifier of the newly created aggregate instance.